Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/employment_support_schemes/schemes_to_support_employment.html.txt.tmx
Source language: en
Languages: ga

source: Schemes to support employment
ga: Scéimeanna chun tacú le fostaíocht

source: There is a range of employment schemes and other supports which encourage long-term unemployed people to return to work
ga: Tá raon scéimeanna fostaíochta ann mar aon le tacaíochtaí eile a spreagann daoine atá dífhostaithe go fadtéarmach chun filleadh ar obair

source: They are aimed at people who have been on unemployment or certain other social welfare payments for a specific period of time
ga: Tá siad dírithe ar dhaoine atá ag fáil sochair dífhostaíochta nó íocaíochtaí leasa shóisialaigh áirithe eile ar feadh saintréimhse ama

source: Some schemes fund community and voluntary organisations to provide employment opportunities which benefit the local community
ga: Maoiníonn scéimeanna áirithe eagraíochtaí pobal agus deonacha chun deiseanna fostaíochta a chur ar fáil atá chun leasa an phobail áitiúil

source: Each scheme has different rules as to who is eligible so it is important to check the detailed information about each scheme
ga: Baineann rialacha éagsúla le gach scéim maidir leo siúd atá incháilithe agus dá réir sin tá sé tábhachtach an fhaisnéis mhionsonraithe a bhaineann le gach scéim a sheiceáil

source: If you are returning to work through one of these schemes your social welfare payment may be affected in different ways, depending on the scheme
ga: Má tá tú ag filleadh ar obair trí cheann de na scéimeanna seo d'fhéadfadh tionchar a bheith aige ar d'íocaíocht leasa shóisialaigh i slite éagsúla, ag brath ar an scéim

source: People on certain disability payments may qualify for the schemes and there are a number of employment supports for people with disabilities
ga: Is féidir le daoine a fhaigheann íocaíochtaí míchumais cáiliú do na scéimeanna agus tá roinnt mhaith tacaíochtaí fostaíochta ann do dhaoine a bhfuil míchumais ag dul dóibh

source: Childcare: If you take up a place on a Department of Social Protection employment programme (except Community Employment), you may be eligible for the After-School Child Care (ASCC) scheme
ga: Cúram leanaí: Má ghlacann tú le háit ar chlár fostaíochta na Roinne Coimirce Sóisialaí (ach amháin Fostaíocht Pobail), d’fhéadfá bheith incháilithe le haghaidh na Scéime Cúram Leanaí Iarscoile

source: There is a separate Community Employment Childcare (CEC) Programme for people who need childcare to take up a place on a Community Employment scheme
ga: Tá Clár Fostaíocht Pobail um Chúram Leanaí ar leith do dhaoine a bhfuil cúram leanaí de dhíth orthu chun áit i scéim Fostaíochta Pobail a ghlacadh

source: Budget 2016: It was announced that from January 2016 there will be an increase of €2.50 per week in top-up payments paid towards meals and travel costs for Community Employment , Rural Social Scheme, Gateway, Job Initiative, Tús and JobBridge participants
ga: Buiséad 2016: D’fhógraíodh go mbeidh méadú €2.50 sa tseachtain íoctha le haghaidh béile agus costas taistil do rannpháirtithe Fostaíocht Pobail, Scéim Sóisialta Tuaithe, Gateway, Tionscnamh Jabanna, Tús agus JobBridge

source: Back to Work Enterprise Allowance
ga: An Liúntas Fiontraíochta um Fhilleadh ar Obair

source: The Back to Work Enterprise Allowance (BTWEA) scheme assists unemployed people and others getting certain social welfare payments to become self-employed
ga: Tugann scéim Liúntas Fiontraíochta um Fhilleadh ar Obair (LFFO) cúnamh do dhaoine dífhostaithe agus ar dhaoine eile a fhaigheann íocaíochtaí leasa shóisialaigh áirithe a bheith féinfhostaithe

source: People who are setting up their own business and who qualify for the BTWEA scheme may retain a percentage of their social welfare payment for up to 2 years
ga: Is féidir le daoine a bhfuil a ngó féin á mbunú acu agus atá incháilithe don scéim LFFO céatadán dá n-íocaíocht leasa shóisialaigh a choimeád ar feadh 2 bliana

source: The Short-Term Enterprise Allowance (STEA) provides support to people getting Jobseeker's Benefit (JB) who want to start their own business
ga: Soláthraíonn an Liúntas Fiontraíochta Gearrthréimhseach (LFG) tacaíocht do dhaoine a fhaigheann Sochar Cuardaitheora Poist (SCP) agus atá ag iarraidh a ngnó féin a thosú

source: The Short-Term Enterprise Allowance is paid instead of your JB and there is no qualifying period, which means you do not need to be getting JB for a certain length of time
ga: Íoctar an Liúntas Fiontraíochta Gearrthréimhseach in áit do SCP agus níl aon tréimhse cháilithe. Ciallaíonn sé nach bhfuil aon ghá duit bheith ag fáil SCP ar feadh fad ama áirithe

source: The Part-time Job Incentive (PTJI) scheme is for people who have been getting Jobseeker’s Allowance for 15 months or more
ga: Tá an Scéim Dreasachta Poist Pháirtaimseartha (SDPP) ann do dhaoine a bhfuil an Liúntas Cuardaitheora Poist á fháil acu ar feadh breis is 15 mhí

source: It allows them to take up part-time work and get a Part-time Job Allowance instead of the Jobseeker’s Allowance
ga: Tugann sí deis dóibh obair pháirtaimseartha a dhéanamh agus Liúntas Poist Pháirtaimseartha a fháil seachas an Liúntas Cuardaitheora Poist

source: Information about how to qualify is in our document, Part-time Job Incentive Scheme
ga: Is féidir faisnéis a fháil faoi conas a bheith incháilithe inár ndoiciméad, Scéim Dreasachta Poist Pháirtaimseartha

source: The Community Employment programme provides long-term unemployed and other disadvantaged people with training and work experience through part-time and temporary placements in jobs based within local communities
ga: Cuireann Clár Fostaíochta Pobail oiliúint agus taithí oibre ar fáil do dhaoine atá dífhostaithe go fadtéarmach agus do dhaoine eile atá faoi mhíbhuntáiste trí shocrúcháin pháirtaimseartha agus shealadacha i bpoist atá lonnaithe laistigh de phobail áitiúla

source: There are 2 different categories of Community Employment: the Part-time Integration Option and the Part-time Job Option
ga: Tá 2 chatagóir dhifriúla d'Fhostaíocht Pobail ann: an Rogha Comhtháthaithe Páirtaimseartha agus an Rogha Poist Pháirtaimseartha

source: The Rural Social Scheme allows low-income farmers and fishermen/women who are unable to earn an adequate living from their farm holding or from fishing earn a supplementary income
ga: Tugann an Scéim Shóisialta na Tuaithe deis d'fheirmeoirí ar ioncam íseal agus d'iascairí nach bhfuil in ann slí bheatha imleor a bhaint amach óna ngabháltas feirme nó ó iascaireacht ioncam forlíontach a thuilleamh

source: Local organisations are funded to provide participants in the scheme with part-time work that benefits rural communities
ga: Maoinítear eagraíochtaí áitiúla chun obair pháirtaimseartha atá tairbheach don phobal tuaithe a chur ar fáil do rannpháirtithe na scéime

source: The Community Services Programme funds community services and community businesses to provide essential services and businesses to their communities which will provide employment to unemployed people and people with disabilities
ga: Maoiníonn an Clár Seirbhísí Pobail seirbhísí pobail agus gnóthaí pobail chun seirbhísí riachtanacha agus gnóthaí a chur ar fáil dá bpobail a chuirfidh fostaíocht ar fáil do dhaoine dífhostaithe agus do dhaoine a bhfuil míchumais ag dul dhóibh

source: The Community Services Programme evolved from the Social Economy Programme and provides funding over 300 groups
ga: D'eascraigh an Clár Seirbhísí Pobail ó Chlár na hEacnamaíochta Sóisialta agus cuireann sé maoiniú ar fáil do bhreis is 300 grúpa

source: The Tús scheme is a community work placement initiative providing work opportunities which benefit the community and are provided by community and voluntary organisations in both urban and rural areas
ga: Tionscnamh socrúcháin oibre pobail is ea an scéim Tús a soláthróidh deiseanna oibre sa phobal chun an pobal a thairbhiú agus tá siad soláthraithe ag eagraíochtaí pobail agus deonacha i gceantair uirbeacha agus tuaithe araon

source: Unemployed people who are eligible to participate in the scheme are selected and contacted by the Department of Social Protection
ga: Roghnaíonn an Roinn Coimirce Sóisialaí daoine dífhostaithe a bhfuil incháilithe don scéim agus déanfaidh an Roinn teagmháil leo

source: The Gateway scheme is a local authority scheme providing work opportunities for long-term unemployed people who have been on the Live Register for over 2 years
ga: Scéim údarás áitiúla is ea Gateway, a sholáthraíonn deiseanna oibre agus oiliúna gearrthéarmacha do dhaoine dífhostaithe atá ar an mBeochláir os cionn 2 bhliain

source: The work opportunities are to benefit the local area
ga: Tá sé i gceist ag na deiseanna oibre ann chun an ceantar áitiúil a thairbhiú

source: JobBridge - National Internship Scheme
ga: JobBridge - Scéim Intéirneachta Náisiúnta

source: JobBridge, National Internship Scheme provides internship placements for unemployed people in private, public, community and voluntary organisations
ga: Cuirfidh JobBridge, an Scéim Náisiúnta Intéirneachta taithí oibre ar fáil do dhaoine dífhostaithe san earnáil phríobháideach, poiblí agus san earnáil dheonach agus pobail

source: Participants must be on the Live Register for 3 months and the internships will last from 6 to 9 months
ga: Caithfidh na rannpháirtithe bheith ar an Beochlár ar feadh 3 mhí agus beidh na hintéirneachtaí ó 6 go 9 mí de ré

source: If they take up an internship they will keep their social welfare payment and will get an extra €50 per week
ga: Má ghlacann siad le hintéirneacht coinneoidh siad a n-íocaíocht leasa shóisialaigh agus gheobhaidh siad €50 sa bhreis in aghaidh na seachtaine

source: The Work Placement Programme provides 9 months’ work experience for unemployed people
ga: Soláthraíonn an Clár Socrúcháin Oibre taithí oibre 9 mí do chéimithe agus do dhaoine dífhostaithe eile

source: The Programme provides places in the private, public, community and voluntary sectors
ga: Níl sé de dhíth ar rannpháirtithe bheith ag fáil íocaíocht leasa shóisialaigh

source: Participants do not have to be getting a social welfare payment but participants who are getting certain social welfare payments for 3 months may keep their payment
ga: Áfach má fhaigheann siad íocaíochtaí leasa shóisialaigh áirithe ar feadh 3 mhí, is féidir a n-íocaíocht a choimeád

source: JobsPlus is a new employer incentive which encourages and rewards employers who employ jobseekers on the Live Register
ga: Dreasacht nua fostóra is ea JobsPlus a spreagann fostóirí cuardaitheoirí poist a fhostú atá ar an mBeochlár agus bronnann an dreasacht luaíocht orthu as amhlaidh a dhéanamh

source: This incentive replaces the Revenue Job Assist and Employer Job (PRSI) Exemption Scheme from 1 July 2013
ga: Tagann an dreasacht seo in ionad na Scéime Postchúnamh Ioncaim agus na Scéime Díolúine Post Fostóra (ÁSPC) ón 1 Iúil 2013

source: Eligible employers who recruit full-time employees on or after 1 July 2013 may apply for the incentive, which will operate on a pilot basis for a period of 6 months
ga: Féadfaidh fostóirí incháilithe a dhéanann fostaithe lánaimseartha a earcú an 1 Iúil 2013, nó ina dhiaidh sin, iarratas a dhéanamh ar an dreasacht, a bheidh ag oibriú ar bhonn píolótach ar feadh 6 mhí

source: Revenue Job Assist is an additional tax allowance for people who have been unemployed for 12 months or more and who are now returning to employment
ga: Is liúntas cánach breise é Postchúnamh Ioncaim do dhaoine a bhí dífhostaithe ar feadh 12 mhí nó tréimhse níos faide ná sin nó atá ag filleadh ar fhostaíocht

source: Revenue Job Assist ceased on 30 June 2013 for new participants and has been replaced by a new JobsPlus incentive scheme since I July 2013
ga: Cuireadh deireadh le Postchúnamh Ioncaim le haghaidh rannpháirtithe nua ar 30 Meitheamh 2013 agus cuireadh scéim dreasachta nua JobsPlus in áit é ó 1 Iúil 2013
